In [1]:
import pandas as pd

## Задание 1

In [56]:
df_logs = pd.read_csv('visit_log.csv',sep=';')

In [61]:
def traffic_source(df):
      if df['traffic_source'] == "yandex" or df['traffic_source'] == "google":
               return 'organic'
      elif (df['traffic_source'] == "paid" or df['traffic_source'] == "email") and df['region'] == 'Russia':
                return 'ad'
      elif (df['traffic_source'] == "paid" or df['traffic_source'] == "email") and df['region'] != 'Russia':
                return 'other' 
      else:
                return df['traffic_source']
      return df

In [62]:
df_logs['source_type'] = df_logs.apply(traffic_source, axis = 1)

## Задание 2

In [63]:
df_url = pd.read_csv('URLs.txt')

In [69]:
df_url_new =df_url[df_url.url.str.contains('\d{8}-')]
df_url_new.head(3)

                                                 url
3  /politics/36188461-s-marta-zhizn-rossiyan-susc...
4  /world/36007585-tramp-pridumal-kak-reshit-ukra...
5  /science/36157853-nasa-sobiraet-ekstrennuyu-pr...

## Задание 3

In [70]:
df_rating = pd.read_csv('ml-latest-small/ratings.csv')

In [101]:
df_average = df_rating[df_rating['userId']>100].groupby('userId')['timestamp'].max() - df_rating[df_rating['userId']>100].groupby('userId')['timestamp'].min()

In [102]:
df_average.head()

userId
101          455
102      5201447
103       436065
104          751
105    113865791
Name: timestamp, dtype: int64

## Задание 4

### К домашнему заданию, задача 2
Дана статистика услуг перевозок клиентов компании по типам:
- rzd - железнодорожные перевозки
- auto - автомобильные перевозки
- air - воздушные перевозки
- client_base - адреса клиентов

In [104]:
rzd = pd.DataFrame(
    {
        'client_id': [111, 112, 113, 114, 115],
        'rzd_revenue': [1093, 2810, 10283, 5774, 981]
    }
)
rzd

   client_id  rzd_revenue
0        111         1093
1        112         2810
2        113        10283
3        114         5774
4        115          981

In [105]:
auto = pd.DataFrame(
    {
        'client_id': [113, 114, 115, 116, 117],
        'auto_revenue': [57483, 83, 912, 4834, 98]
    }
)
auto

   client_id  auto_revenue
0        113         57483
1        114            83
2        115           912
3        116          4834
4        117            98

In [106]:
air = pd.DataFrame(
    {
        'client_id': [115, 116, 117, 118],
        'air_revenue': [81, 4, 13, 173]
    }
)
air

   client_id  air_revenue
0        115           81
1        116            4
2        117           13
3        118          173

In [107]:
client_base = pd.DataFrame(
    {
        'client_id': [111, 112, 113, 114, 115, 116, 117, 118],
        'address': ['Комсомольская 4', 'Энтузиастов 8а', 'Левобережная 1а', 'Мира 14', 'ЗЖБИиДК 1', 
                    'Строителей 18', 'Панфиловская 33', 'Мастеркова 4']
    }
)
client_base

   client_id          address
0        111  Комсомольская 4
1        112   Энтузиастов 8а
2        113  Левобережная 1а
3        114          Мира 14
4        115        ЗЖБИиДК 1
5        116    Строителей 18
6        117  Панфиловская 33
7        118     Мастеркова 4

In [111]:
all_df = rzd.merge(auto, on = 'client_id', how = 'outer')

In [112]:
all_df = all_df.merge(air, on = 'client_id', how = 'outer')

In [116]:
all_df.head()

   client_id  rzd_revenue  auto_revenue  air_revenue
0        111       1093.0           NaN          NaN
1        112       2810.0           NaN          NaN
2        113      10283.0       57483.0          NaN
3        114       5774.0          83.0          NaN
4        115        981.0         912.0         81.0

In [114]:
all_df_adress = all_df.merge(client_base, on = 'client_id', how = 'outer')

In [117]:
all_df_adress

   client_id  rzd_revenue  auto_revenue  air_revenue          address
0        111       1093.0           NaN          NaN  Комсомольская 4
1        112       2810.0           NaN          NaN   Энтузиастов 8а
2        113      10283.0       57483.0          NaN  Левобережная 1а
3        114       5774.0          83.0          NaN          Мира 14
4        115        981.0         912.0         81.0        ЗЖБИиДК 1
5        116          NaN        4834.0          4.0    Строителей 18
6        117          NaN          98.0         13.0  Панфиловская 33
7        118          NaN           NaN        173.0     Мастеркова 4